In [2]:
#!pip install gspread

In [4]:
import pandas as pd
import gspread

gc = gspread.service_account(filename = "C:\\Users\\Lenovo\\Downloads\\iquestproject01-432e62a666e3.json")

In [5]:
gc

In [6]:
sheet = gc.open_by_url("https://docs.google.com/spreadsheets/d/14gnIt3J9VPGna2ZuPSzxPKxnB83afFYDyWzogM18z1w/edit?usp=sharing")

In [7]:
sheet

In [9]:
ws = sheet.worksheet('emp1')

In [10]:
ws

In [11]:
df = pd.DataFrame(ws.get_all_records())

In [12]:
df

      name1  age1
0   rafique    25
1   Safique    28
2  Musfique    30
3     Rifat    32

In [13]:
ws2 = sheet.worksheet('emp2')

In [14]:
ws2

In [15]:
df = pd.DataFrame(ws2.get_all_records())

In [16]:
df

     name2  age2
0    rakin    27
1   Safiar    29
2  Musfofa    31
3     Rafi    35